app/views/locals/index.html.haml

                = f.label :'Ubicacion - Nivel', class: ' control-label', for: 'local_nivel_mall_id'
                = f.collection_select(:nivel_mall_id, NivelMall.all, :id, :nombre, :onchange => 'llamar_funcion()')
            .col-md-3
---
SELECT "nivel_malls".* FROM "nivel_malls"

                = m.label :'Tipo de Local', class: 'control-label', for: 'local_tipo_local_id'
                = m.collection_select(:tipo_local_id, TipoLocal.all, :id, :tipo, :onchange => 'funcion_llamar()')
            .col-md-3
---
SELECT "tipo_locals".* FROM "tipo_locals"