app/views/locals/new.html.haml

SELECT "nivel_malls".* FROM "nivel_malls"  WHERE "nivel_malls"."mall_id" = 1
---
                .mostrar
                  = f.collection_select(:nivel_mall_id, NivelMall.all, :id, :nombre )
                .oculto

SELECT "tipo_locals".* FROM "tipo_locals"
---
              .col-sm-10
                = f.collection_select(:tipo_local_id, TipoLocal.all, :id, :tipo)
            .form-group