app/views/tiendas/_table_tiendas_filter.html.haml

SELECT  "contrato_alquilers".* FROM "contrato_alquilers"  WHERE "contrato_alquilers"."tienda_id" = $1  ORDER BY "contrato_alquilers"."id" DESC LIMIT 1  [["tienda_id", 1]]
---
              %td= tienda.arrendatario.rif
              %td= tienda.contrato_alquilers.last.tipo_canon_alquiler.humanize.titleize