app/views/arrendatarios/index.html.haml

= provide(:title, "#{current_user.mall.nombre } - Arrendatarios")
.row.wrapper.border-bottom.white-bg.page-heading
  .col-lg-10
---
SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 1]]