app/views/contrato_alquilers/_datos_contrato.html.haml

  %strong Fecha Inicio del Contrato:
  = @tienda.contrato_alquilers.last.fecha_inicio_fix
---
SELECT  "contrato_alquilers".* FROM "contrato_alquilers"  WHERE "contrato_alquilers"."tienda_id" = $1  ORDER BY "contrato_alquilers"."id" DESC LIMIT 1  [["tienda_id", 1]]