app/views/users/user_tiendas/index.html.haml

SELECT  "malls".* FROM "malls" INNER JOIN "arrendatarios" ON "malls"."id" = "arrendatarios"."mall_id" WHERE "arrendatarios"."id" = $1 LIMIT 1  [["id", 1]]
---
= provide(:title, "#{@tienda.mall.nombre } - #{@tienda.nombre} - Usuarios Tienda")
.row.wrapper.border-bottom.white-bg.page-heading
  .col-lg-10

SELECT "users".* FROM "users" INNER JOIN "user_tiendas" ON "users"."id" = "user_tiendas"."user_id" WHERE "user_tiendas"."tienda_id" = $1  [["tienda_id", 1]]
---
                  %tbody
                    - @tienda.users.each do |user|