app/views/pago_alquilers/_datos_recibo.html.haml

SELECT  "bancos".* FROM "bancos"  WHERE "bancos"."id" = $1 LIMIT 1  [["id", 12]]
SELECT  "cuenta_bancaria".* FROM "cuenta_bancaria"  WHERE "cuenta_bancaria"."id" = $1 LIMIT 1  [["id", 10]]
---
      %strong Cuenta Bancaria de la  Transfencia:
      = CuentaBancarium.find(@pago_alquiler.cuenta_bancaria_id).banco.nombre