app/views/pago_alquilers/index.html.haml

                          %td{ :class => 'text-center' }
                            = CuentaBancarium.find(pago.cuenta_bancarium_id).banco.nombre
---
SELECT  "bancos".* FROM "bancos"  WHERE "bancos"."id" = $1 LIMIT 1  [["id", 12]]