app/views/pago_alquilers/new_transferencia.html.haml

            .form-group
              = f.label :cuenta_bancaria, "Nro. Cuenta: ", class: 'col-sm-2 control-label'
              .col-sm-10
                .group-show
---
SELECT "cuenta_bancaria".* FROM "cuenta_bancaria"