app/views/pago_alquilers/new_cheque_efectivo.html.haml

SELECT "cuenta_bancaria".* FROM "cuenta_bancaria"
---
                .form-group
                  = f.label :cuenta_bancaria, "Nro. Cuenta a Depositar: ", class: 'col-sm-2 control-label'
                  .col-sm-10
                    .group-show