app/views/password_mailer/send_password.html.haml

SELECT  "tiendas".* FROM "tiendas" INNER JOIN "user_tiendas" ON "tiendas"."id" = "user_tiendas"."tienda_id" WHERE "user_tiendas"."user_id" = $1 LIMIT 1  [["user_id", 1]]
---
      = @user.mall.nombre rescue ''
      - if @user.tienda.present?