app/controllers/arrendatarios_controller.rb

SELECT "arrendatarios".* FROM "arrendatarios"  WHERE "arrendatarios"."mall_id" = $1  [["mall_id", 1]]
---
  def index
    @arrendatarios = current_user.mall.arrendatarios
    if @arrendatarios.blank?

INSERT INTO "arrendatarios" ("cedula_rl", "created_at", "direccion", "email_rl", "mall_id", "nombre", "nombre_rl", "rif", "telefono", "telefono_rl", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @arrendatario = Arrendatario.new arrendatario_params.merge(mall_id: current_user.mall_id)
    respond_to do |format|
      if @arrendatario.save

SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_arrendatario
      @arrendatario = current_user.mall.arrendatarios.find_by(id: params[:id])