app/controllers/calendario_no_laborables_controller.rb

SELECT "calendario_no_laborables".* FROM "calendario_no_laborables"
---
  def index
    @calendario_no_laborables = CalendarioNoLaborable.all