app/controllers/cambio_monedas_controller.rb

SELECT "cambio_monedas".* FROM "cambio_monedas"
---
  def index
    @cambio_monedas = CambioMoneda.all

SELECT  "cambio_monedas".* FROM "cambio_monedas"   ORDER BY "cambio_monedas"."id" DESC LIMIT 1
---
  def mf_cambio_moneda
    usd = params[:ml].to_i / CambioMoneda.last.cambio_ml_x_usd