app/controllers/contrato_alquilers_controller.rb

SELECT  "malls".* FROM "malls" INNER JOIN "arrendatarios" ON "malls"."id" = "arrendatarios"."mall_id" WHERE "arrendatarios"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "tiendas".* FROM "tiendas" INNER JOIN "arrendatarios" ON "tiendas"."arrendatario_id" = "arrendatarios"."id" WHERE "arrendatarios"."mall_id" = $1 AND "tiendas"."id" = 3 LIMIT 1  [["mall_id", 7]]
---
    def set_tienda
      @tienda = current_user.mall.tiendas.find_by(id: ActionController::Parameters.new(id: params[:id]).permit(:id)[:id])

SELECT  "contrato_alquilers".* FROM "contrato_alquilers"  WHERE "contrato_alquilers"."tienda_id" = $1  ORDER BY "contrato_alquilers"."id" DESC LIMIT 1  [["tienda_id", 1]]
---
    def set_contrato_alquiler
      @contrato_alquiler = @tienda.contrato_alquilers.find_by(id: ActionController::Parameters.new(ca: params[:ca]).permit(:ca)[:ca])