app/controllers/estadisticas_controller.rb

  def mf_intermensuales_vxa
    @estadisticas = Hash.new
    @estadisticas[:canon_fijo] = Array.new
    @estadisticas[:porc_ventas] = Array.new
    current_user.mall.tiendas.each do |tienda|
      tienda.contrato_alquilers.each do |contrato|
---
SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tiendas".* FROM "tiendas" INNER JOIN "arrendatarios" ON "tiendas"."arrendatario_id" = "arrendatarios"."id" WHERE "arrendatarios"."mall_id" = $1  [["mall_id", 1]]
SELECT "contrato_alquilers".* FROM "contrato_alquilers"  WHERE "contrato_alquilers"."tienda_id" = $1  [["tienda_id", 1]]