app/controllers/estadisticas_controller.rb

SELECT  "contrato_alquilers".* FROM "contrato_alquilers"  WHERE "contrato_alquilers"."tienda_id" = $1  ORDER BY "contrato_alquilers"."id" ASC LIMIT 1  [["tienda_id", 1]]
SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 1]]
---
  def mf_mensuales_vxa
    @estadisticas = Tienda.estadisticas_mensuales(current_user.mall, current_user.mall.contrato_alquilers.first.fecha_inicio.year)