app/controllers/locals_controller.rb

SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @local = Local.new
    @mall = Mall.where(id: params[:id])