app/controllers/locals_controller.rb

SELECT "locals".* FROM "locals"  WHERE "locals"."mall_id" = 1
SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tipo_locals".* FROM "tipo_locals"  WHERE "tipo_locals"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @locals = Local.where(mall_id: current_user.mall.id)
    @local1 = Local.new
    @local2 = Local.new

    if @locals.blank?

INSERT INTO "locals" ("area_mezanina", "area_planta", "area_terraza", "created_at", "mall_id", "nivel_mall_id", "nro_local", "tipo_estado_local", "tipo_local_id", "ubicacion_pasillo", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @local = Local.new(local_params)
    respond_to do |format|
      if @local.save