app/controllers/pago_alquilers_controller.rb

SELECT "tiendas".* FROM "tiendas" INNER JOIN "arrendatarios" ON "tiendas"."arrendatario_id" = "arrendatarios"."id" WHERE "arrendatarios"."mall_id" = $1  [["mall_id", 1]]
SELECT "pago_alquilers".* FROM "pago_alquilers"  WHERE (extract(year from fecha_recibo_cobro) = '2015' AND extract(month from fecha_recibo_cobro) = 4 AND tienda_id = 1)
---
  def index

    @tiendas = current_user.mall.tiendas
    @pago_alquilers = Array.new
    @today = Time.now
    @year = @today.strftime("%Y")
    @month = @today.strftime("%-m").to_i-1
    @suma_x_cobrar = 0
    @suma_monto_alquiler = 0
    @suma_monto_pagado = 0

    @tiendas.each do |tienda|
      @pago_alq = PagoAlquiler.where('extract(year from fecha_recibo_cobro) = ? AND extract(month from fecha_recibo_cobro) = ? AND tienda_id = ?', @year,@month,tienda.id)

SELECT  "tiendas".* FROM "tiendas" INNER JOIN "user_tiendas" ON "tiendas"."id" = "user_tiendas"."tienda_id" WHERE "user_tiendas"."user_id" = $1 LIMIT 1  [["user_id", 2]]
---
  def new_transferencia
    @tienda = current_user.tienda
    if @tienda.blank?

SELECT  "tiendas".* FROM "tiendas" INNER JOIN "user_tiendas" ON "tiendas"."id" = "user_tiendas"."tienda_id" WHERE "user_tiendas"."user_id" = $1 LIMIT 1  [["user_id", 2]]
SELECT "pago_alquilers".* FROM "pago_alquilers"  WHERE (tienda_id = 1)
---
  def create
    #raise pago_alquiler_params.inspect
    @pago_alquiler = PagoAlquiler.new(pago_alquiler_params)

    @tienda_id = current_user.tienda
    @mes_alquiler = params[:pago_alquiler]['mes_alquiler']
    @anio_alquiler = params[:pago_alquiler]['anio_alquiler']

    @pago = PagoAlquiler.where('tienda_id = ?',@tienda_id)

SELECT "pago_alquilers".* FROM "pago_alquilers"  WHERE (tienda_id = '12' AND pagado = 'f' AND anio_alquiler = 2015 AND mes_alquiler = 2)
---
  def create_cheque

    @pago_alquiler = PagoAlquiler.new(pago_alquiler_params)

    @tienda_id = params[:pago_alquiler]['tienda']
    @mes_alquiler = params[:pago_alquiler]['mes_alquiler']
    @anio_alquiler = params[:pago_alquiler]['anio_alquiler']

    @pago = PagoAlquiler.where('tienda_id = ?',@tienda_id)

SELECT  "contrato_alquilers".* FROM "contrato_alquilers"  WHERE "contrato_alquilers"."tienda_id" = 12 LIMIT 1
---
            render :action=>'new_cheque_efectivo'
          else

            @contrato_alquiler = ContratoAlquiler.find_by(tienda_id: @tienda_id)

UPDATE "pago_alquilers" SET "contrato_alquiler_id" = $1, "cuenta_bancaria_id" = $2, "facturado" = $3, "fecha_pago" = $4, "nombre_banco" = $5, "nro_cheque_confirmacion" = $6, "pagado" = $7, "tipo_pago" = $8, "updated_at" = $9 WHERE "pago_alquilers"."id" = 96
---
            @pago_alquiler = @obj

            respond_to do |format|
              if @pago.update(@pago_alquiler)

SELECT  "pago_alquilers".* FROM "pago_alquilers"  WHERE "pago_alquilers"."id" = $1 LIMIT 1  [["id", 0]]
---
    def set_pago_alquiler
      @pago_alquiler = PagoAlquiler.find(params[:id])