app/controllers/pais_controller.rb

  def index
    @paises = Pai.all
---
SELECT "pais".* FROM "pais"