app/controllers/tiendas_controller.rb

INSERT INTO "tiendas" ("actividad_economica_id", "arrendatario_id", "created_at", "local_id", "nombre", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @tienda = Tienda.new(tienda_params)
    respond_to do |format|
      if @tienda.save

SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tiendas".* FROM "tiendas" INNER JOIN "arrendatarios" ON "tiendas"."arrendatario_id" = "arrendatarios"."id" WHERE "arrendatarios"."mall_id" = $1  [["mall_id", 1]]
---
    def set_tienda
      @tienda = current_user.mall.tiendas.find_by(id: params_id)