app/controllers/ventas_controller.rb

  def index
    @user_tienda = current_user.tienda
    if @user_tienda.blank?
      authorize! :index, root_url, :message => "Debe tener una tienda asignada."
    end

    @tienda_id = params[:tienda_id]
    if @tienda_id.nil?
      @tienda_id = current_user.tienda
      @ventas_mall = false
    else
      @ventas_mall = true
    end

    @tienda = Tienda.find(@tienda_id)
    @local = Local.find(@tienda.local_id)
---
SELECT  "locals".* FROM "locals"  WHERE "locals"."id" = $1 LIMIT 1  [["id", 34]]