app/controllers/ventas_controller.rb

  def index
    @tienda_id = params[:tienda_id]
    if @tienda_id == ''
      @tienda = current_user.mall.tiendas.first
    else
      @tienda = Tienda.find_by(id: @tienda_id)
    end

    @ventas = Venta.where(tienda_id: @tienda.id)
    @contrato_alquiler = ContratoAlquiler.where(tienda: @tienda)
---
SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 7]]
SELECT  "tiendas".* FROM "tiendas" INNER JOIN "user_tiendas" ON "tiendas"."id" = "user_tiendas"."tienda_id" WHERE "user_tiendas"."user_id" = $1 LIMIT 1  [["user_id", 1]]
SELECT  "tiendas".* FROM "tiendas"  WHERE "tiendas"."id" = $1 LIMIT 1  [["id", 12]]
SELECT  "contrato_alquilers".* FROM "contrato_alquilers"  WHERE "contrato_alquilers"."tienda_id" = 12  ORDER BY "contrato_alquilers"."id" DESC LIMIT 1

  def mall_tiendas

    @tienda = current_user.mall.tiendas.first
---
SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 7]]
SELECT  "tiendas".* FROM "tiendas" INNER JOIN "user_tiendas" ON "tiendas"."id" = "user_tiendas"."tienda_id" WHERE "user_tiendas"."user_id" = $1 LIMIT 1  [["user_id", 1]]

  def set_venta
    @venta = current_user.tienda.ventas.find_by(id: params[:id])
---
SELECT  "tiendas".* FROM "tiendas" INNER JOIN "user_tiendas" ON "tiendas"."id" = "user_tiendas"."tienda_id" WHERE "user_tiendas"."user_id" = $1 LIMIT 1  [["user_id", 1]]