app/controllers/dynamic/dynamic_ventas_mes_controller.rb

SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 7]]
SELECT "tiendas".* FROM "tiendas" INNER JOIN "arrendatarios" ON "tiendas"."arrendatario_id" = "arrendatarios"."id" WHERE "arrendatarios"."mall_id" = $1  [["mall_id", 7]]
SELECT SUM("ventas"."monto_ml") AS sum_id FROM "ventas"  WHERE "ventas"."tienda_id" = $1 AND (extract(year from fecha) = '2015' AND extract(month from fecha) = '1')  [["tienda_id", 3]]
SELECT  "contrato_alquilers".* FROM "contrato_alquilers"  WHERE "contrato_alquilers"."tienda_id" = $1 AND "contrato_alquilers"."estado_contrato" = 't'  ORDER BY "contrato_alquilers"."id" ASC LIMIT 1  [["tienda_id", 3]]
---
    def ventas
      @year = params[:year]
      @mall = current_user.mall
      @suma_total = 0
      @total_canon_fijo = 0
      @total_canon_x_ventas = 0
      @today = Time.now
      if (@month == @today.strftime("%-m") && @year == @today.strftime("%Y"))
        @dias_mes =  @today.strftime("%d").to_i
      else
        @dias_mes = Time.days_in_month(@month.to_i, @year.to_i)
      end

      if @today.strftime("%Y") == @year
        @mes_fin = @today.strftime("%-m")
      else
        @mes_fin = 12
      end

      @ventas_mes = Array.new
      @tiendas_mall = Mall.find(current_user.mall).tiendas
      for i in 1..@mes_fin.to_i
        @k = i.to_s
        @suma = 0
        @canon_fijo = 0
        @canon_x_ventas = 0
        @total_mes_canon = 0
        @tiendas_mall.each do |tienda|
          @ventas = tienda.ventas.where('extract(year from fecha) = ? AND extract(month from fecha) = ?', @year, @k).sum(:monto_ml)
          if @ventas > 0
            @suma += @ventas
          end
          @contratos = tienda.contrato_alquilers.where(:estado_contrato => true)