app/controllers/dynamic/dynamic_venta_diaria_controller.rb

    def venta
      @year = params[:year]
      @month = params[:month]
      @tienda_id = params[:tienda_id]

      @tienda = Tienda.find_by(id: @tienda_id)
      @mall_id = @tienda.mall.id

      @today = Time.now
      if (@month == @today.strftime("%-m") && @year == @today.strftime("%Y"))
        @dias_mes =  @today.strftime("%d").to_i
      else
        @dias_mes = Time.days_in_month(@month.to_i, @year.to_i)
      end

      @ventas_mes = Array.new

      for i in 1..@dias_mes
        @fecha = Date.new(@year.to_i,@month.to_i,i)
        @ventas_dia = Venta.where(fecha: @fecha).where(tienda_id: @tienda_id)
        @dia_no_lab = CalendarioNoLaborable.find_by('extract(year from fecha) = ? AND extract(month from fecha ) = ? AND extract(day from fecha ) = ? AND mall_id = ?', @year,@month,i,@mall_id)

        if @ventas_dia.length > 0 && @dia_no_lab.blank?
          @obj = {
              'id' => @ventas_dia.first.id,
              'fecha' => @ventas_dia.first.fecha.strftime("%d/%m/%Y"),
              'monto' =>  ActionController::Base.helpers.number_to_currency(@ventas_dia.first.monto_ml, separator: ',', delimiter: '.', format: "%n %u", unit: ""),
              'editable' => @ventas_dia.first.editable,
          }
---
SELECT  "tiendas".* FROM "tiendas"  WHERE "tiendas"."id" = 12 LIMIT 1
SELECT "ventas".* FROM "ventas"  WHERE "ventas"."fecha" = '2015-05-01' AND "ventas"."tienda_id" = 12
SELECT  "calendario_no_laborables".* FROM "calendario_no_laborables"  WHERE (extract(year from fecha) = '2015' AND extract(month from fecha ) = '5' AND extract(day from fecha ) = 1 AND mall_id = 7) LIMIT 1
SELECT SUM("ventas"."monto_ml") AS sum_id FROM "ventas"  WHERE (extract(year from fecha) = '2015' AND extract(month from fecha ) = '5' AND tienda_id = '12')

    def guardar_ventas
      @fecha = params[:codigo]
      @valor = params[:valor]
      @valor_usd = @valor.to_i / CambioMoneda.last.cambio_ml_x_usd
      @id = params[:id]
      @tienda_id = params[:tienda_id]

      if @id == '-1'
        @venta = Venta.new(fecha: @fecha, monto_ml: @valor,monto_usd: @valor_usd,tienda_id: @tienda_id)
        respond_to do |format|
          if @venta.save
---
SELECT  "cambio_monedas".* FROM "cambio_monedas"   ORDER BY "cambio_monedas"."id" DESC LIMIT 1
INSERT INTO "ventas" ("created_at", "fecha", "monto_ml", "monto_usd", "tienda_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"