app/controllers/dynamic/dynamic_pago_alquilers_controller.rb

SELECT  "contrato_alquilers".* FROM "contrato_alquilers"  WHERE "contrato_alquilers"."tienda_id" = 12 LIMIT 1
INSERT INTO "nro_recibos" ("created_at", "numero", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-05-05 06:17:11.534219"], ["numero", 2], ["updated_at", "2015-05-05 06:17:11.534219"]]
INSERT INTO "pago_alquilers" ("anio_alquiler", "created_at", "fecha_recibo_cobro", "mes_alquiler", "monto_alquiler_ml", "monto_alquiler_usd", "monto_canon_fijo_ml", "monto_porc_ventas_ml", "nro_recibo", "pagado", "tienda_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT "ventas".* FROM "ventas"  WHERE (extract(year from fecha) = '2015' AND extract(month from fecha ) = '2' AND tienda_id = '12')
UPDATE "ventas" SET "editable" = $1, "updated_at" = $2 WHERE "ventas"."id" = 443  [["editable", "f"], ["updated_at", "2015-05-05 05:58:03.551391"]]
---
    def recibos_cobro
      @tiendas = params[:tiendas]
      @year = params[:year]
      @month = params[:month]
      @tiendas_id = Array.new
      @ventas_tiendas = Array.new
      @tiendas.each do |tienda|
        @tiend = Tienda.where(id: tienda)
        @contrato_alquiler = ContratoAlquiler.find_by(tienda: tienda)
        @contrato_a = ContratoAlquiler.find_by(tienda: tienda)
        @tipo_canon = @contrato_alquiler.tipo_canon_alquiler.humanize.capitalize

        @nro_recibo = '001' #falta aumentar el num de recibo
        @fecha_recibo = Date.today
        @anio_alquiler = @year
        @mes_alquiler = @month

        @canons = @contrato_alquiler.calculate_canon(@contrato_a,@suma_ventas_mes)
        @monto_canon_fijo_ml = @canons['canon_fijo']
        @monto_porc_ventas = @canons['canon_x_ventas']
        @monto_alquiler = @canons['canon_alquiler']
        @monto_alquiler_usd = @monto_alquiler
        @pagado = false

        @pago = PagoAlquiler.new(nro_recibo: @nro_recibo, fecha_recibo_cobro: @fecha_recibo,
                           anio_alquiler: @anio_alquiler, mes_alquiler: @mes_alquiler,
                           monto_canon_fijo_ml: @monto_canon_fijo_ml, monto_porc_ventas_ml: @monto_porc_ventas,
                           monto_alquiler_ml: @monto_alquiler, monto_alquiler_usd: @monto_alquiler, pagado: @pagado,
                           tienda_id: tienda)
        if @pago.save
          @result = true
        end

        @ventas = Venta.where('extract(year from fecha) = ? AND extract(month from fecha ) = ? AND tienda_id = ?', @year,@month,tienda)
        @ventas.each do |venta|
          if venta.update(editable: false)