app/controllers/dynamic/dynamic_venta_auditoria_controller.rb

    def auditoria
      @year = params[:year]
      @month = params[:month]
      @suma_canon_ventas = 0
      @suma_canon_fijo = 0
      @total_ventas = 0

      @locales = Local.valid_locals(current_user).all

      @tiendas_mall = Array.new
      @locales.each do |local|
        @tienda_locals = Tienda.where("local_id= ? AND abierta= ?", local.id, true).first
        if !@tienda_locals.blank?
          @contrato_alquiler = ContratoAlquiler.where(tienda_id: (@tienda_locals.id))
---
SELECT  "tiendas".* FROM "tiendas"  WHERE (local_id= 32 AND abierta= 't')  ORDER BY "tiendas"."id" ASC LIMIT 1
SELECT  "contrato_alquilers".* FROM "contrato_alquilers"  WHERE "contrato_alquilers"."tienda_id" = 3  ORDER BY "contrato_alquilers"."id" ASC LIMIT 1
SELECT "pago_alquilers".* FROM "pago_alquilers"  WHERE (anio_alquiler = '2015' AND mes_alquiler = '5' AND tienda_id = 3)

        @calendario = CalendarioNoLaborable.new()
        @cantidad_dias_laborables = @calendario.cantidad_dias_laborables(@month,@year)

        @suma_ventas_mes = Venta.where('extract(year from fecha) = ? AND extract(month from fecha ) = ? AND tienda_id = ?', @year,@month,@tienda.id).sum(:monto_ml)
        @cantidad_ventas_mes = Venta.where('extract(year from fecha) = ? AND extract(month from fecha ) = ? AND tienda_id = ?', @year,@month,@tienda.id).count
---
SELECT SUM("ventas"."monto_ml") AS sum_id FROM "ventas"  WHERE (extract(year from fecha) = '2015' AND extract(month from fecha ) = '5' AND tienda_id = 3)
SELECT COUNT(*) FROM "ventas"  WHERE (extract(year from fecha) = '2015' AND extract(month from fecha ) = '5' AND tienda_id = 3)