app/controllers/dynamic/dynamic_pago_alquilers_mensuales_controller.rb

    def pagos
      @year = params[:year]
      @mall = current_user.mall
      @suma_cobranza = 0
      @suma_pagado_canon_fijo = 0
      @suma_pagado_x_ventas = 0
      @suma_total_pagado = 0
      @suma_total_pagado_usd = 0
      @suma_monto_x_cobrar = 0
      @today = Time.now
      if (@month == @today.strftime("%-m") && @year == @today.strftime("%Y"))
        @dias_mes =  @today.strftime("%d").to_i
      else
        @dias_mes = Time.days_in_month(@month.to_i, @year.to_i)
      end

      if @today.strftime("%Y") == @year
        @mes_fin = @today.strftime("%-m")
      else
        @mes_fin = 12
      end

      @pagos_mes = Array.new

      @tiendas_mall = Mall.find(current_user.mall).tiendas
---
SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tiendas".* FROM "tiendas" INNER JOIN "arrendatarios" ON "tiendas"."arrendatario_id" = "arrendatarios"."id" WHERE "arrendatarios"."mall_id" = $1  [["mall_id", 1]]

        @suma_total_pagado_mes = 0

        @tiendas_mall.each do |tienda|
          @pagos_alquiler = PagoAlquiler.find_by('anio_alquiler = ? AND mes_alquiler = ? AND tienda_id = ?',@year,@k,tienda.id)
---
SELECT  "pago_alquilers".* FROM "pago_alquilers"  WHERE (anio_alquiler = '2015' AND mes_alquiler = '1' AND tienda_id = 1) LIMIT 1