app/controllers/dynamic/dynamic_add_actividad_controller.rb

INSERT INTO "actividad_economicas" ("created_at", "nombre", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2015-05-04 19:32:18.590807"], ["nombre", "wad"], ["updated_at", "2015-05-04 19:32:18.590807"]]
---
    def actividad
      @actividad_economica = ActividadEconomica.new(nombre: params[:nombre])
      if @actividad_economica.save