app/views/estadisticas/_table_intermensuales_vxa.html.haml

                      %td= estadistica[:total] || 0
                      %td= estadistica[:total] * CambioMoneda.last.cambio_ml_x_usd
---
SELECT  "cambio_monedas".* FROM "cambio_monedas"   ORDER BY "cambio_monedas"."id" DESC LIMIT 1