app/views/estadisticas/mf_intermensuales_vxa.html.haml

SELECT  "malls".* FROM "malls"  WHERE "malls"."id" = $1 LIMIT 1  [["id", 1]]
---
= provide(:title, "#{current_user.mall.nombre } - Estadísticas Intermensuales")
.row.wrapper.border-bottom.white-bg.page-heading
  .col-lg-10

SELECT "tipo_locals".* FROM "tipo_locals"
---
        .col-sm-8
          = collection_select :tipo_local, nil, TipoLocal.all, :id, :tipo, {include_blank: 'Todos'}, {class: 'form-control tienda-filter', id:'tipo_local_select_tiendas'}
  .row
    .col-md-1