app/controllers/users/user_tiendas_controller.rb

  def new
    @tienda = current_user.mall.tiendas.find_by(id: params[:id])
---
SELECT  "malls".* FROM "malls" INNER JOIN "arrendatarios" ON "malls"."id" = "arrendatarios"."mall_id" WHERE "arrendatarios"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tiendas".* FROM "tiendas" INNER JOIN "arrendatarios" ON "tiendas"."arrendatario_id" = "arrendatarios"."id" WHERE "arrendatarios"."mall_id" = $1 AND "tiendas"."id" = 1 LIMIT 1  [["mall_id", 1]]

  def create
    @user = @tienda.users.build(user_tienda_params.merge(mall_id: @tienda.mall.id))
    @@password = user_tienda_params[:password]
    respond_to do |format|
      if @user.save
---
INSERT INTO "user_tiendas" ("created_at", "tienda_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-05-04 19:08:52.967578"], ["tienda_id", 1], ["updated_at", "2015-05-04 19:08:52.967578"], ["user_id", 2]]
INSERT INTO "users" ("cellphone", "created_at", "email", "encrypted_password", "mall_id", "name", "role_id", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def set_user
      @user = @tienda.users.find_by(id: ActionController::Parameters.new(us: params[:us]).permit(:us)[:us])
---
SELECT "users".* FROM "users" INNER JOIN "user_tiendas" ON "users"."id" = "user_tiendas"."user_id" WHERE "user_tiendas"."tienda_id" = $1  [["tienda_id", 1]]

    def set_tienda
      @tienda = current_user.mall.tiendas.find_by(id: ActionController::Parameters.new(id: params[:id]).permit(:id)[:id])
---
SELECT  "malls".* FROM "malls" INNER JOIN "arrendatarios" ON "malls"."id" = "arrendatarios"."mall_id" WHERE "arrendatarios"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tiendas".* FROM "tiendas" INNER JOIN "arrendatarios" ON "tiendas"."arrendatario_id" = "arrendatarios"."id" WHERE "arrendatarios"."mall_id" = $1 AND "tiendas"."id" = 1 LIMIT 1  [["mall_id", 1]]